# FilterNumericLessOrEqual Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericLessOrEqual Class
Members See Also
---
Tests whether numeric values from the document are less than or equal to a certain value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterNumericLessOrEqual : FilterNumericRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterNumericLessOrEqual _
	Inherits FilterNumericRuleEvaluator
```

Visual C++
---
```text
public ref class FilterNumericLessOrEqual : public FilterNumericRuleEvaluator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterNumericRuleEvaluator Autodesk.Revit.DB..::..FilterNumericLessOrEqual
# See Also
FilterNumericLessOrEqual Members
Autodesk.Revit.DB Namespace